portfolio_two/app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`, `user_id`) VALUES ('aiueo', 'wakaranakunattekita', '2021-08-27 12:35:00.044656', '2021-08-27 12:35:00.044656', 1)
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def user
    User.find(id: self.user_id)

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC
---
  def index
    @posts = Post.all.order(created_at: :desc)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 9 LIMIT 1
UPDATE `posts` SET `posts`.`content` = 'aaa', `posts`.`updated_at` = '2021-08-28 13:35:50.171819' WHERE `posts`.`id` = 18
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)