portfolio_two/app/controllers/users/registrations_controller.rb

  def update
    super
    @user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `username`) VALUES ('asd@asd', '$2a$12$YyjsOYnz4t.A1dn6UuOUkepow8PS6DqBk2dlMVjFx5Ma521ShPUgy', '2021-08-27 17:30:33.952807', '2021-08-27 17:30:33.952807', 'フルヤエリコ')
UPDATE `users` SET `users`.`email` = 'asd@asd36', `users`.`updated_at` = '2021-08-27 15:50:53.144231' WHERE `users`.`id` = 7